Repository: GevTonoyan/boardify
Catalog: lib/localizations/l10n/app_*.arb
Languages: ru

source: Settings
ru: Настройки

# settings_darkMode
source: Dark Mode
ru: Тёмная тема

# settings_localeName
source: English
ru: Русский

source: App Settings
ru: Настройки приложения

# mode1
source: Single Word
ru: Одно слово

# mode2
source: Card Mode
ru: Режим карты

source: Single Word Mode
ru: Режим одного слова

# selectMode
source: Select Game Mode
ru: Выберите режим игры

source: Word Pack
ru: Пакет слов

source: Round
ru: Раунд

# rulesTitle
source: Rules
ru: Правила

# singleModeRule1
source: One player explains a single word at a time.
ru: Один игрок объясняет одно слово за раз.

# singleModeRule2
source: The team tries to guess as many words as possible before the timer runs out.
ru: Команда пытается угадать как можно больше слов, пока не истечёт время.

# singleModeRule3
source: The explainer cannot use the word itself, any part of it, a translation, a rhyme, or spelling hints.
ru: Объясняющий не может использовать само слово, его часть, перевод, рифму или подсказки по написанию.

# singleModeRule4
source: Teammates can guess as many times as they want.
ru: Товарищи по команде

# singleModeRule5
source: When guessed correctly, a new word appears.
ru: Можете угадывать столько раз, сколько захотите

# singleModeRule6
source: If the word is skipped, 1 point is deducted (can be changed in settings).
ru: Когда слово угадано правильно, появляется новое слово

# cardModeRule1
source: The explainer receives a card with multiple words (usually 5–7).
ru: Объясняющий получает карточку с несколькими словами (обычно 5–7).

# cardModeRule2
source: All words on the card must be guessed before the timer runs out.
ru: Все слова на карточке должны быть угаданы до истечения времени

# cardModeRule3
source: Players can guess the words in any order.
ru: Игроки могут угадывать слова в любом порядке.

# cardModeRule4
source: Skipping is not allowed — you must guess every word on the card.
ru: Пропускать нельзя — нужно угадать каждое слово на карточке

# cardModeRule5
source: The explainer cannot use the word itself, any part of it, a translation, a rhyme, or spelling hints.
ru: Объясняющий не может использовать само слово, его часть, перевод, рифму или подсказки по написанию.

# cardModeRule6
source: Score is based on the number guessed words
ru: Счёт основан на количестве угаданных слов

# settings_general
source: General
ru: Общие

# settings_roundDuration
source: Round Duration (sec)
ru: Длительность раунда (сек)

# settings_pointsToWin
source: Points to Win
ru: Очки для победы

# settings_soundEffects
source: Sound Effects
ru: Звуковые эффекты

# settings_allowSkipping
source: Allow Skipping
ru: Разрешить пропуск

# settings_penaltyForSkipping
source: Penalty for Skipping
ru: Штраф за пропуск

# settings_wordsPerCard
source: Words per Card
ru: Количество слов на карточке

# settings_reset
source: Reset Settings
ru: Сбросить настройки

# word_packs_fail
source: Failed to load word packs
ru: Не удалось загрузить пакеты слов

# failedLoadWords
source: Couldn't load words
ru: Не удалось загрузить слова

# preGameTitle
source: Get Ready
ru: Подготовьтесь

# preGameTeamSetup
source: Team Setup
ru: Настройка команд

# preGameTeam
source: Team
ru: Команда

# preGameAddTeam
source: Add Team
ru: Добавить команду

# roundOverview_teamTurn
source: It's {teamName}'s turn!
ru: Сейчас ход команды {teamName}.

# roundOverview_point
source: {points, plural, one {{points} point} other {{points} points}}
ru: {points, plural, one {{points} очко} other {{points} очков}}

# roundOverview_roundScores
source: Round Scores:
ru: Очки по раундам:

# roundOverview_confirmExit_title
source: Exit Game?
ru: Выйти из игры?

# roundOverview_confirmExit_message
source: If you close this screen, all game progress will be lost. Are you sure you want to exit?
ru: Если вы закроете этот экран, весь прогресс игры будет потерян. Вы уверены, что хотите выйти?

# countdown_go
source: Go!
ru: Вперёд!

# summary_gameOver
source: Game Over
ru: Игра окончена

# summary_winner
source: Winner
ru: Победитель

# summary_playAgain
source: Play Again
ru: Играть снова

# summary_mainMenu
source: Main Menu
ru: Главное меню

# general_startGame
source: Start Game
ru: Начать игру

# general_checkInternet
source: Check your internet connection
ru: Проверьте ваше интернет-соединение

# general_tryAgain
source: Try Again
ru: Попробовать снова

# general_yes
source: Yes
ru: Да

# general_no
source: No
ru: Нет
