Repository: GevTonoyan/boardify
Catalog: core/app_core/lib/localizations/l10n/app_*.arb
Languages: am

# games_availableGames
source: Available Games
am: Առկա խաղեր

# games_aliasDescription
source: Guess words with your team
am: Գուշակեք բառերը ձեր թիմի հետ

source: Settings
am: Կարգավորումներ

# settings_darkMode
source: Dark Mode
am: Մութ ռեժիմ

# settings_localeName
source: English
am: Հայերեն

# alias_title
source: Alias
am: Ալիաս

# alias_mode1
source: Single Word
am: Մի բառ

# alias_mode2
source: Card Mode
am: Քարտի ռեժիմ

# alias_singleWordMode
source: Single Word Mode
am: Մի բառի ռեժիմ

# alias_selectMode
source: Select Game Mode
am: Ընտրեք խաղի ռեժիմը

# alias_wordPack
source: Word Pack
am: Բառերի փաթեթ

# alias_round
source: Round
am: Ռաունդ

# alias_rulesTitle
source: Alias Rules
am: Ալիասի կանոնները

# alias_singleModeRule1
source: One player explains a single word at a time.
am: Մի խաղացող բացատրում է մեկ բառ

# alias_singleModeRule2
source: The team tries to guess as many words as possible before the timer runs out.
am: Թիմը փորձում է գուշակել հնարավորինս շատ բառեր, մինչ ժամանակը կավարտվի

# alias_singleModeRule3
source: The explainer cannot use the word itself, any part of it, a translation, a rhyme, or spelling hints.
am: Բացատրողը չի կարող օգտագործել բառը, դրա որևէ արմատ, թարգմանություն, հնչյունական կամ ուղղագրական հուշումներ

# alias_singleModeRule4
source: Teammates can guess as many times as they want.
am: Թիմակիցները կարող են գուշակել այնքան անգամ, որքան ցանկանում են

# alias_singleModeRule5
source: When guessed correctly, a new word appears.
am: Երբ բառը ճիշտ գուշակվում է, նոր բառ է հայտնվում

# alias_singleModeRule6
source: If the word is skipped, 1 point is deducted (can be changed in settings).
am: Եթե բառը բաց թողնվի, 1 միավոր է հանվում (կարող է փոխվել կարգավորումներում)

# alias_cardModeRule1
source: The explainer receives a card with multiple words (usually 5–7).
am: Բացատրողը ստանում է քարտ, որի վրա մի քանի բառ կա (Սովորաբար 5-7)

# alias_cardModeRule2
source: All words on the card must be guessed before the timer runs out.
am: Քարտի բոլոր բառերը պետք է գուշակվեն, մինչ ժամանակը կավարտվի

# alias_cardModeRule3
source: Players can guess the words in any order.
am: Խաղացողները կարող են գուշակել բառերը ցանկացած հերթականությամբ

# alias_cardModeRule4
source: Skipping is not allowed — you must guess every word on the card.
am: Բաց թողնելը թույլ չի տրվում՝ դուք պետք է գուշակեք քարտի բոլոր բառերը

# alias_cardModeRule5
source: The explainer cannot use the word itself, any part of it, a translation, a rhyme, or spelling hints.
am: Բացատրողը չի կարող օգտագործել բառը, դրա որևէ արմատ, թարգմանություն, հնչյունական կամ ուղղագրական հուշումներ

# alias_cardModeRule6
source: Score is based on the number guessed words
am: Միավորները հաշվարկվում են գուշակված բառերի քանակով

source: Alias Settings
am: Ալիասի կարգավորումներ

# alias_settings_general
source: General
am: Ընդհանուր

# alias_settings_roundDuration
source: Round Duration (sec)
am: Ռաունդի տևողությունը (վրկ)

# alias_settings_pointsToWin
source: Points to Win
am: Միավորներ հաղթելու համար

# alias_settings_soundEffects
source: Sound Effects
am: Ձայնային էֆեկտներ

# alias_settings_allowSkipping
source: Allow Skipping
am: Թույլ տալ բաց թողնել

# alias_settings_penaltyForSkipping
source: Penalty for Skipping
am: Պատիժ բաց թողնելու համար

# alias_settings_wordsPerCard
source: Words per Card
am: Քարտի բառերի քանակը

# alias_settings_reset
source: Reset Settings
am: Վերականգնել կարգավորումները

# alias_word_packs_fail
source: Failed to load word packs
am: Բառերի փաթեթները բեռնելը ձախողվեց

# alias_failedLoadWords
source: Couldn't load words
am: Բառերը բեռնելը ձախողվեց

# alias_preGameTitle
source: Get Ready
am: Պատրաստվեք

# alias_preGameTeamSetup
source: Team Setup
am: Թիմերի կարգավորում

# alias_preGameTeam
source: Team
am: Թիմ

# alias_preGameAddTeam
source: Add Team
am: Ավելացնել թիմ

# alias_roundOverview_teamTurn
source: It's {teamName}'s turn!
am: Ընթացիկ հերթը՝ {teamName} թիմինն է։

# alias_roundOverview_point
source: {points, plural, one {{points} point} other {{points} points}}
am: {points, plural, one {{points} միավոր} other {{points} միավոր}}

# alias_roundOverview_roundScores
source: Round Scores:
am: Փուլի միավորներ:

# general_startGame
source: Start Game
am: Սկսել խաղը

# general_checkInternet
source: Check your internet connection
am: Ստուգեք ձեր ինտերնետային կապը

# general_tryAgain
source: Try Again
am: Կրկին փորձել
